# Worksheet: SQL (MySQL) ‚Äî `students` Table

> Goal: practice 
- **CREATE TABLE**, 
- **INSERT**, 
- **SELECT**, 
- **UPDATE**, and 
- **DELETE**, 

while exploring datatypes such as `INT`, `VARCHAR`, `DECIMAL/NUMERIC`, and `DATE`.

‚ö†Ô∏è This worksheet **does not** use *FOREIGN KEYS*.

## üìì Environment setup (Jupyter Notebook)
If you're running this in a fresh environment, install the required packages.

In [ ]:
pip install ipykernel jupyterlab jupysql pymysql cryptography --upgrade --no-cache-dir

## Connect JupySQL to your MySQL server
1) Load the `sql` extension.
2) Connect to your server (replace user, password, host, port, and database).

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://mysql_user:mysql_password@localhost:3306/mydatabase

%config SqlMagic.displaylimit = 0

Connecting to 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

---
## Exercise 1 ‚Äî Create the `students` table
Create a table named **`students`** with the following fields:
- `id` (integer, primary key, auto-increment)
- `name` (text)
- `major` (text)
- `gpa` (decimal/numeric, 2 decimal places)
- `birthdate` (date)

Requirements:
- `name`, `major`, `gpa`, and `birthdate` may or may **not** accept `NULL`.

üí° Tip: before creating, you can run 
```SQL
DROP TABLE IF EXISTS <table_namae>;
```

üí° Tip: (CREATE syntax example):
```SQL
-- This is a sample table
CREATE TABLE <table_name> (
  <id_column> INT AUTO_INCREMENT PRIMARY KEY,
  <text_column> VARCHAR(<max_length>),
  <decimal_column> DECIMAL(<precision>,<scale>),
  <date_column> DATE,
  <time_column> TIME,
  <datetime_column> DATETIME
);
```

üí° Tip: - Make sure dates use the format `YYYY-MM-DD` (See more about [ISO 8601](https://www.iso.org/iso-8601-date-and-time-format.html) and other [MySQL reference](https://dev.mysql.com/doc/refman/8.4/en/date-and-time-literals.html)).

**Answer**:

In [23]:
%%sql

-- EXERCISE 1:
-- 1) (Optional) Drop the table if it already exists
DROP TABLE IF EXISTS students;

-- 2) Create the students table with the required fields
CREATE TABLE students (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    major VARCHAR(100),
    gpa DECIMAL(4, 2),
    birthdate DATE  
);

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

++
||
++
++

## Exercise 2 ‚Äî Confirm the structure (SELECT)
Write a query to confirm the table was created and the datatypes are correct.

üí° Tip: In MySQL you can use `DESCRIBE <table_name>;` or `SHOW COLUMNS FROM <table_name>;` or `SELECT * FROM <table_name>;`.

**Answer:**

In [24]:
%%sql

-- Show all tables in the database to confirm the creation of the students table
SHOW TABLES;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

1 rows affected.

+----------------------+
| Tables_in_mydatabase |
+----------------------+
|       students       |
+----------------------+

In [25]:
%%sql

-- Describe the structure of the students table to confirm the correct creation of fields
DESCRIBE students;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

5 rows affected.

+-----------+--------------+------+-----+---------+----------------+
|   Field   |     Type     | Null | Key | Default |     Extra      |
+-----------+--------------+------+-----+---------+----------------+
|     id    |     int      |  NO  | PRI |   None  | auto_increment |
|    name   | varchar(100) |  NO  |     |   None  |                |
|   major   | varchar(100) | YES  |     |   None  |                |
|    gpa    | decimal(4,2) | YES  |     |   None  |                |
| birthdate |     date     | YES  |     |   None  |                |
+-----------+--------------+------+-----+---------+----------------+

In [26]:
%%sql

-- Show the columns of the students table to confirm the correct creation of fields
SHOW COLUMNS FROM students;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

5 rows affected.

+-----------+--------------+------+-----+---------+----------------+
|   Field   |     Type     | Null | Key | Default |     Extra      |
+-----------+--------------+------+-----+---------+----------------+
|     id    |     int      |  NO  | PRI |   None  | auto_increment |
|    name   | varchar(100) |  NO  |     |   None  |                |
|   major   | varchar(100) | YES  |     |   None  |                |
|    gpa    | decimal(4,2) | YES  |     |   None  |                |
| birthdate |     date     | YES  |     |   None  |                |
+-----------+--------------+------+-----+---------+----------------+

In [27]:
%%sql

-- Show all records in the students table to confirm that it is currently empty
SELECT * FROM students;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

+----+------+-------+-----+-----------+
| id | name | major | gpa | birthdate |
+----+------+-------+-----+-----------+
+----+------+-------+-----+-----------+

---
## Exercise 3 ‚Äî Insert data (10 records)
Insert **10 students** into the `students` table using **a single** `INSERT INTO ... VALUES (...), (...), ...;` statement.

Use exactly this data:
| id | name               | major            |   gpa | birthdate  |
| -: | ------------------ | ---------------- | ----: | ---------- |
|  1 | Ana Silva          | Computer Science | 17.50 | 2007-03-14 |
|  2 | Bruno Costa        | Mathematics      | 14.20 | 2006-11-02 |
|  3 | Carla Mendes       | Biology          | 16.10 | 2007-07-29 |
|  4 | Daniel Rocha       | Engineering      | 13.80 | 2006-01-18 |
|  5 | Eva Santos         | Mathematics      | 18.30 | 2007-09-05 |
|  6 | Filipe Almeida     | Mathematics      | 12.60 | 2006-05-21 |
|  7 | Guilherme Ferreira | Mathematics      | 15.70 | 2007-12-10 |
|  8 | Helena Sousa       | Physics          | 16.90 | 2006-08-03 |
|  9 | In√™s Pereira       | Biology          | 13.10 | 2007-02-27 |
| 10 | Jo√£o Martins       | Chemistry        | 14.90 | 2006-04-16 |


üí° Tips:
- If `id` is `AUTO_INCREMENT`, you may omit `id` in your `INSERT`.

**Answer:**

In [28]:
%%sql

-- EXERCISE 3:
-- note that the id field is auto-incremented, so we do not need to specify it in the INSERT statement

INSERT INTO students (name, major, gpa, birthdate) VALUES
    ('Ana Silva', 'Computer Science', 17.50, '2007-03-14'),
    ('Bruno Costa', 'Economics', 14.20, '2006-11-02'),
    ('Carla Mendes', 'Biology', 16.10, '2007-07-29'),
    ('Daniel Rocha', 'Engineering', 13.80, '2006-01-18'),
    ('Eva Santos', 'Mathematics', 18.30, '2007-09-05'),
    ('Filipe Almeida', 'Mathematics', 12.60, '2006-05-21'),
    ('Guilherme Ferreira', 'Mathematics', 15.70, '2007-12-10'),
    ('Helena Sousa', 'Physics', 16.90, '2006-08-03'),
    ('In√™s Pereira', 'Biology', 13.10, '2007-02-27'),
    ('Jo√£o Martins', 'Chemistry', 14.90, '2006-04-16')
;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

10 rows affected.

++
||
++
++

## Exercise 4 ‚Äî Check inserts (SELECT)
Write a `SELECT` query to show all records from `students`.

**Answer:**

In [29]:
%%sql

-- EXERCISE 4:
-- SELECT all records from the students table to confirm the successful insertion of data
SELECT * FROM students;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

10 rows affected.

+----+--------------------+------------------+-------+------------+
| id |        name        |      major       |  gpa  | birthdate  |
+----+--------------------+------------------+-------+------------+
| 1  |     Ana Silva      | Computer Science | 17.50 | 2007-03-14 |
| 2  |    Bruno Costa     |    Economics     | 14.20 | 2006-11-02 |
| 3  |    Carla Mendes    |     Biology      | 16.10 | 2007-07-29 |
| 4  |    Daniel Rocha    |   Engineering    | 13.80 | 2006-01-18 |
| 5  |     Eva Santos     |   Mathematics    | 18.30 | 2007-09-05 |
| 6  |   Filipe Almeida   |   Mathematics    | 12.60 | 2006-05-21 |
| 7  | Guilherme Ferreira |   Mathematics    | 15.70 | 2007-12-10 |
| 8  |    Helena Sousa    |     Physics      | 16.90 | 2006-08-03 |
| 9  |    In√™s Pereira    |     Biology      | 13.10 | 2007-02-27 |
| 10 |    Jo√£o Martins    |    Chemistry     | 14.90 | 2006-04-16 |
+----+--------------------+------------------+-------+------------+

---
## Exercise 5 ‚Äî Update data (UPDATE)
Update **Bruno Costa**'s `gpa` to **15.00**.

Then, run a `SELECT` query for that student only to confirm the change.

üí° Tip (UPDATE syntax):

```sql
UPDATE <table_name>
SET <column_1> = <new_value_1>,
    <column_2> = <new_value_2>
WHERE <id_column> = <some_id>;
```

**Answer:**

In [31]:
%%sql

-- EXERCISE 5:
-- 1) UPDATE Bruno Costa's GPA to 15.00
UPDATE students
SET gpa = 15.00
WHERE name = 'Bruno Costa';

-- 2) SELECT to confirm
SELECT id, gpa FROM students WHERE name = 'Bruno Costa';

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

1 rows affected.

1 rows affected.

+----+-------+
| id |  gpa  |
+----+-------+
| 2  | 15.00 |
+----+-------+

---
## Exercise 6 ‚Äî Delete records (DELETE)
Delete **one or more** students with `gpa` **below 13.00**.

Then, run a `SELECT` query to confirm which records remain.

```sql
DELETE FROM <table_name>
WHERE <condition>;
```
or
```sql
DELETE FROM <table_name>
WHERE <id_column> = <some_id>;
```

**Answer:**

In [32]:
%%sql

-- EXERCISE 6:
-- 1) DELETE (gpa < 13.00)
DELETE FROM students
WHERE gpa < 13.00;

-- 2) SELECT to check the current state of the table
SELECT *
FROM students;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

1 rows affected.

9 rows affected.

+----+--------------------+------------------+-------+------------+
| id |        name        |      major       |  gpa  | birthdate  |
+----+--------------------+------------------+-------+------------+
| 1  |     Ana Silva      | Computer Science | 17.50 | 2007-03-14 |
| 2  |    Bruno Costa     |    Economics     | 15.00 | 2006-11-02 |
| 3  |    Carla Mendes    |     Biology      | 16.10 | 2007-07-29 |
| 4  |    Daniel Rocha    |   Engineering    | 13.80 | 2006-01-18 |
| 5  |     Eva Santos     |   Mathematics    | 18.30 | 2007-09-05 |
| 7  | Guilherme Ferreira |   Mathematics    | 15.70 | 2007-12-10 |
| 8  |    Helena Sousa    |     Physics      | 16.90 | 2006-08-03 |
| 9  |    In√™s Pereira    |     Biology      | 13.10 | 2007-02-27 |
| 10 |    Jo√£o Martins    |    Chemistry     | 14.90 | 2006-04-16 |
+----+--------------------+------------------+-------+------------+

---
## Exercise 7 ‚Äî ORDER BY
Write a query that shows:
- `id`, `name`, `major`, `gpa`
- sorted by `gpa` (highest to lowest)


üí° Tip (SELECT + ORDER BY syntax):
```SQL
SELECT <column_1>, <column_2>, <column_3>
FROM <table_name>
ORDER BY <sort_column> DESC;
```
or
```SQL
SELECT <column_1>, <column_2>, <column_3>
FROM <table_name>
ORDER BY <sort_column> DESC, <secondary_column> ASC;
```

**Answer:**

In [33]:
%%sql

-- EXERCISE 7:
-- SELECT with ORDER BY
SELECT id, name, major, gpa
FROM students
ORDER BY gpa DESC;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

9 rows affected.

+----+--------------------+------------------+-------+
| id |        name        |      major       |  gpa  |
+----+--------------------+------------------+-------+
| 5  |     Eva Santos     |   Mathematics    | 18.30 |
| 1  |     Ana Silva      | Computer Science | 17.50 |
| 8  |    Helena Sousa    |     Physics      | 16.90 |
| 3  |    Carla Mendes    |     Biology      | 16.10 |
| 7  | Guilherme Ferreira |   Mathematics    | 15.70 |
| 2  |    Bruno Costa     |    Economics     | 15.00 |
| 10 |    Jo√£o Martins    |    Chemistry     | 14.90 |
| 4  |    Daniel Rocha    |   Engineering    | 13.80 |
| 9  |    In√™s Pereira    |     Biology      | 13.10 |
+----+--------------------+------------------+-------+

---
## Exercise 8 ‚Äî SELECT with filters
Write **two** different `SELECT` queries:
1) Show only students whose `major` is `Computer Science`.
2) Show students with `gpa` between **15.00** and **18.00** (inclusive).

**Answer:**

In [34]:
%%sql

-- EXERCISE 8 (1):
-- SELECT with WHERE major = 'Computer Science'
SELECT *
FROM students
WHERE major = 'Computer Science';

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

1 rows affected.

+----+-----------+------------------+-------+------------+
| id |    name   |      major       |  gpa  | birthdate  |
+----+-----------+------------------+-------+------------+
| 1  | Ana Silva | Computer Science | 17.50 | 2007-03-14 |
+----+-----------+------------------+-------+------------+

**Answer:**

In [35]:
%%sql

-- EXERCISE 8 (2):
-- SELECT with WHERE gpa BETWEEN 15.00 AND 18.00
SELECT *
FROM students
WHERE gpa BETWEEN 15.00 AND 18.00;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

5 rows affected.

+----+--------------------+------------------+-------+------------+
| id |        name        |      major       |  gpa  | birthdate  |
+----+--------------------+------------------+-------+------------+
| 1  |     Ana Silva      | Computer Science | 17.50 | 2007-03-14 |
| 2  |    Bruno Costa     |    Economics     | 15.00 | 2006-11-02 |
| 3  |    Carla Mendes    |     Biology      | 16.10 | 2007-07-29 |
| 7  | Guilherme Ferreira |   Mathematics    | 15.70 | 2007-12-10 |
| 8  |    Helena Sousa    |     Physics      | 16.90 | 2006-08-03 |
+----+--------------------+------------------+-------+------------+

---
## Challenge (optional) ‚Äî GROUP BY (by major)
Write a query that shows, **for each major**:
- the major name
- the **number of students** in that major
- the **average GPA** for that major

üí° Tip: Use `GROUP BY <column>` with aggregate functions like `COUNT()` and `AVG()`.

**Answer:**

In [37]:
%%sql

-- CHALLENGE:
-- Show, for each major:
-- 1) number of students
-- 2) average GPA
-- (Optional) order by average GPA (highest to lowest)

SELECT
  major,
  COUNT(*) AS num_students,
  ROUND(AVG(gpa), 2) AS avg_gpa
FROM students
GROUP BY major
ORDER BY avg_gpa DESC;

Running query in 'mysql+pymysql://mysql_user:***@localhost:3306/mydatabase'

7 rows affected.

+------------------+--------------+---------+
|      major       | num_students | avg_gpa |
+------------------+--------------+---------+
| Computer Science |      1       |  17.50  |
|   Mathematics    |      2       |  17.00  |
|     Physics      |      1       |  16.90  |
|    Economics     |      1       |  15.00  |
|    Chemistry     |      1       |  14.90  |
|     Biology      |      2       |  14.60  |
|   Engineering    |      1       |  13.80  |
+------------------+--------------+---------+

---
**end of doc**